package com.alekseev.student_planner.data

data class Lesson(
    val id: String,
    val subjectName: String,
    val professor: String,
    val time: String,
    val room: String,
    val dayOfWeek: String
)

val sampleSchedule = listOf(
    Lesson(
        "1",
        "Разработка мобильных приложений",
        "Леонтьев Д.А.",
        "09:00–10:30",
        "305",
        "Понедельник"),
    Lesson(
        "2",
        "Системное программирование",
        "Токаев Т.И.", "10:45–12:15",
        "402",
        "Понедельник"),
    Lesson(
        "3",
        "Управление проектами",
        "Трошина О.В.",
        "13:00–14:30",
        "210",
        "Вторник"),
    Lesson(
        "4",
        "Инструментальные средства разработки ПО",
        "Леонтьев Д.А.",
        "14:45–16:15",
        "305",
        "Вторник"),
    Lesson(
        "5",
        "Математическое моделирование",
        "Трошина О.В.",
        "09:00–10:30",
        "208",
        "Среда"),
    Lesson(
        "6",
        "Обеспечение качества функционирования КС",
        "Ушакова М.А.",
        "10:45–12:15",
        "307",
        "Среда"),
    Lesson(
        "7",
        "Разработка программных модулей",
        "Донскова Д.А.",
        "13:00–14:30",
        "401",
        "Четверг"),
    Lesson(
        "8",
        "Физическая культура",
        "Магомедов С.К.",
        "14:45–16:15",
        "Спортзал",
        "Четверг"),
    Lesson(
        "9",
        "Менеджмент в профессиональной деятельности",
        "Запорожская С.А.",
        "09:00–10:30",
        "205",
        "Пятница"),
    Lesson(
        "10",
        "Иностранный язык",
        "Пенькова О.В.",
        "10:45–12:15",
        "112",
        "Пятница")
)